""" 
Напишите функцию mean(), которая принимает произвольное количество аргументов 
и возвращает среднее арифметическое переданных в нее числовых (int или float) аргументов.
Если числовых аргументов не будет, функция должна вернуть 0.

Примечание 1. 
Обратите внимание: функция должна принимать не список, а именно произвольное количество аргументов.

Примечание 2. 
Функция должна игнорировать аргументы всех типов, кроме int или float.

Примечание 3. 
Вызывать функцию mean() не нужно, требуется только реализовать ее.
"""

def mean(*args):
    res = []
    for arg in args:
        if type(arg) == int or type(arg) == float:
            res.append(arg)   
    if len(res) == 0:
        return 0
    else:
        return sum(res) / len(res)


print(mean(1.5, True, ['stepik'], 'beegeek', 2.5, (1, 2)))
print(mean(-1, 2, 3, 10, ('5')))
