""" 
Напишите функцию print_products(), которая принимает произвольное количество аргументов 
и выводит список продуктов (любая непустая строка) в следующем формате: 
<номер продукта>) <название продукта> (нумерация продуктов начинается с единицы). 
Если среди переданных аргументов нет ни одного продукта, необходимо вывести текст Нет продуктов.

Примечание 1. 
Обратите внимание: функция должна принимать не список, а именно произвольное количество аргументов.

Примечание 2. 
Числа, списки, кортежи, словари, множества и другие нестроковые объекты продуктами не являются, 
и их нужно игнорировать.

Примечание 3. 
Обратите внимание: функция print_products() должна выводить (печатать) нужное значение, 
а не возвращать его.

Примечание 4.
Вызывать функцию print_products() не нужно, требуется только реализовать ее.
"""


def print_products(*args):
    res = []
    for v in args:
        if type(v) == str and len(v):
            res.append(v)
    if len(res) == 0:
        print('Нет продуктов')
    else:
        for k, v in enumerate(res, start=1):
            print(f'{k}) {v}')
        

print_products('Бананы', [1, 2], ('Stepik',),
               'Яблоки', '', 'Макароны', 5, True)
