""" 
Напишите функцию greet(), 
которая принимает произвольное количество строк-имен (как минимум одну) 
и возвращает приветствие в соответствии с тестовыми данными.

Примечание 1. 
Обратите внимание: функция должна принимать не список, 
а именно произвольное количество аргументов.

Примечание 2. 
Вызывать функцию greet() не нужно, требуется только реализовать ее.
"""


def greet(*names):
    if len(names) == 1:
        return f"Hello, {names[0]}!"
    elif len(names) == 2:
        return f"Hello, {names[0]} and {names[1]}!"
    else:
        # Все имена, кроме последнего, перечисляем через запятую, а последнее добавляем через «and»
        all_but_last = " and ".join(names[:-1])
        last = names[-1]
        return f"Hello, {all_but_last} and {last}!"


print(greet('Timur', 'Roman', 'Ruslan'))
