""" 
Вам доступен список numbers, содержащий кортежи чисел. 
Напишите программу, которая с помощью встроенных функций min() и max() 
выводит те кортежи (каждый на отдельной строке), которые имеют минимальное и максимальное среднее арифметическое значение элементов.

Примечание 1. Считайте, что список numbers уже объявлен в вашей программе, и вы имеете к нему доступ.

Примечание 2. Используйте необязательный параметр key.
"""


numbers = [(-1, 2), (3, 14), (5, 6, 9)]

def avg(t):
    return sum(t) / len(t)


min_tuple = min(numbers, key=avg)
max_tuple = max(numbers, key=avg)

print(min_tuple)
print(max_tuple)
