""" 
Математические функции
Напишите программу, которая принимает число и название функции, а выводит результат применения функции к данному числу.

Список возможных функций:

квадрат: функция принимает число и возвращает его квадрат;
куб: функция принимает число и возвращает его куб;
корень: функция принимает число и возвращает корень квадратный из этого числа;
модуль: функция принимает число и возвращает его модуль;
синус: функция принимает число (в радианах) и возвращает синус этого числа.

Формат входных данных
На вход программе подается целое число и название функции, записанные на отдельных строках.

Формат выходных данных
Программа должна выдать результат применения функции к числу.

Примечание. Решите задачу без использования условного оператора.
"""

from math import *
def kv(i): return i**2
def kb(i): return i**3
def kr(i): return i**0.5
def md(i): return abs(i)
def sn(i): return sin(i)


k = {'квадрат': kv,
     'куб': kb,
     'корень': kr,
     'модуль': md,
     'синус': sn,
     }

n = int(input())
f = input()

print(k[f](n))
