""" 
Вам доступен список numbers. 
Напишите программу, которая с помощью функции map() округляет все элементы списка numbers 
до 2 десятичных знаков, а затем выводит их, каждый на отдельной строке.

Примечание 1. 
Считайте, что список numbers уже объявлен в вашей программе, и вы имеете к нему доступ.

Примечание 2. 
При решении задачи нужно использовать функцию map(), написанную в конспекте урока.
"""


numbers = [4.12, 1.3257, 9.37037, 4.552, 3.186]

def map(function, items):
    result = []
    for item in items:
        new_item = function(item)
        result.append(new_item)

    return result

# Функция для округления до 2 знаков после запятой
def round_2(x):
    return round(x, 2)


# Применяем map с нашей функцией округления
rounded_numbers = map(round_2, numbers)

# Выводим каждый элемент на отдельной строке
for num in rounded_numbers:
    print(num)
