""" 
Напишите функцию is_non_negative_num(), используя синтаксис анонимных функций, 
которая принимает строковый аргумент и возвращает значение True, 
если переданный аргумент является неотрицательным числом (целым или вещественным),
или False в противном случае.

Примечание 1. 
Вызывать функцию is_non_negative_num() не нужно, требуется только реализовать ее.

Примечание 2. 
Неотрицательные числа — это положительные числа и число нуль.
"""

is_non_negative_num = lambda s: s.replace('.', '', 1).isdigit() and float(s) >= 0

print(is_non_negative_num('10.34ab'))
print(is_non_negative_num('10.45'))
