""" 
Напишите функцию is_num(), используя синтаксис анонимных функций, 
которая принимает строковый аргумент и возвращает значение True, 
если переданный аргумент является числом (целым или вещественным), 
или False в противном случае.

Примечание 1. 
Вызывать функцию is_num() не нужно, требуется только реализовать ее.

Примечание 2. 
Используйте вспомогательную функцию из прошлого степа.
"""

is_num = lambda el: (el[1:].replace(".", "", 1)).isdigit() if len(el) > 1  else el.isdigit()

print(is_num('10.45'))
print(is_num('-18'))
print(is_num('10.34ab'))
