""" 
Вам доступен список words. 
Напишите программу, которая с помощью встроенных функций filter() и sorted() выводит слова из списка words, 
имеющие длину ровно 6 символов. 
Слова следует вывести в алфавитном порядке на одной строке, отделяя символом пробела.

Примечание 1. 
Используйте анонимную функцию в качестве критерия фильтрации.

Примечание 2. 
Считайте, что список words уже объявлен в вашей программе, и вы имеете к нему доступ.
"""

words = ['justice', 'orange', 'plant', 'sunday']
print(*sorted(filter(lambda x: len(x) == 6, words)))