"""
Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.



Формат входных данных
На вход программе подаётся натуральное число
𝑛
n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных
Программа должна вывести одно число — максимальный элемент в заштрихованной области квадратной матрицы.

Примечание. Элементы диагоналей также учитываются.
"""
n = int(input())
matrix = []
for i in range(n):
    matrix.append(list(map(int, input().split())))
max_el = -100
for i in range(n):
    for j in range(n):
        if j <= i <= n - 1 - j or j >= i >= n - 1 - j:
            if matrix[i][j] > max_el:
                max_el = matrix[i][j]

print(max_el)